Revit 2024 API
FunctionId Members
The FunctionId type exposes the following members.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetObjectData
Retrieves data needed to serialize the target object.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
File
The name of the file including the function throwing an exception.
Function
The name of the function throwing an exception.
Line
The line number of the function throwing an exception.
See Also
FunctionId Class
Autodesk.Revit.Exceptions Namespace